openthread/openthread/third_party/ti/devices/cc26x0/inc/hw_ccfg.h
// Field:     [2] WRT_PROT_SEC_66
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_66                        0x00000004
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_66_BITN                            2
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_66_M                      0x00000004
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_66_S                               2

// Field:     [1] WRT_PROT_SEC_65
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_65                        0x00000002
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_65_BITN                            1
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_65_M                      0x00000002
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_65_S                               1

// Field:     [0] WRT_PROT_SEC_64
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_64                        0x00000001
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_64_BITN                            0
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_64_M                      0x00000001
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_64_S                               0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_PROT_127_96
//
//*****************************************************************************
// Field:    [31] WRT_PROT_SEC_127
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_127                      0x80000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_127_BITN                         31
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_127_M                    0x80000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_127_S                            31

// Field:    [30] WRT_PROT_SEC_126
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_126                      0x40000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_126_BITN                         30
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_126_M                    0x40000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_126_S                            30

// Field:    [29] WRT_PROT_SEC_125
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_125                      0x20000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_125_BITN                         29
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_125_M                    0x20000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_125_S                            29

// Field:    [28] WRT_PROT_SEC_124
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_124                      0x10000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_124_BITN                         28
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_124_M                    0x10000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_124_S                            28

// Field:    [27] WRT_PROT_SEC_123
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_123                      0x08000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_123_BITN                         27
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_123_M                    0x08000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_123_S                            27

// Field:    [26] WRT_PROT_SEC_122
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_122                      0x04000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_122_BITN                         26
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_122_M                    0x04000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_122_S                            26

// Field:    [25] WRT_PROT_SEC_121
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_121                      0x02000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_121_BITN                         25
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_121_M                    0x02000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_121_S                            25

// Field:    [24] WRT_PROT_SEC_120
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_120                      0x01000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_120_BITN                         24
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_120_M                    0x01000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_120_S                            24

// Field:    [23] WRT_PROT_SEC_119
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_119                      0x00800000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_119_BITN                         23
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_119_M                    0x00800000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_119_S                            23

// Field:    [22] WRT_PROT_SEC_118
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_118                      0x00400000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_118_BITN                         22
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_118_M                    0x00400000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_118_S                            22

// Field:    [21] WRT_PROT_SEC_117
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_117                      0x00200000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_117_BITN                         21
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_117_M                    0x00200000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_117_S                            21

// Field:    [20] WRT_PROT_SEC_116
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_116                      0x00100000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_116_BITN                         20
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_116_M                    0x00100000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_116_S                            20

// Field:    [19] WRT_PROT_SEC_115
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_115                      0x00080000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_115_BITN                         19
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_115_M                    0x00080000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_115_S                            19

// Field:    [18] WRT_PROT_SEC_114
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_114                      0x00040000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_114_BITN                         18
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_114_M                    0x00040000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_114_S                            18

// Field:    [17] WRT_PROT_SEC_113
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_113                      0x00020000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_113_BITN                         17
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_113_M                    0x00020000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_113_S                            17

// Field:    [16] WRT_PROT_SEC_112
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_112                      0x00010000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_112_BITN                         16
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_112_M                    0x00010000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_112_S                            16

// Field:    [15] WRT_PROT_SEC_111
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_111                      0x00008000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_111_BITN                         15
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_111_M                    0x00008000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_111_S                            15

