openthread/openthread/third_party/ti/devices/cc26x0/inc/hw_ccfg.h
// Field:    [14] WRT_PROT_SEC_110
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_110                      0x00004000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_110_BITN                         14
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_110_M                    0x00004000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_110_S                            14

// Field:    [13] WRT_PROT_SEC_109
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_109                      0x00002000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_109_BITN                         13
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_109_M                    0x00002000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_109_S                            13

// Field:    [12] WRT_PROT_SEC_108
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_108                      0x00001000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_108_BITN                         12
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_108_M                    0x00001000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_108_S                            12

// Field:    [11] WRT_PROT_SEC_107
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_107                      0x00000800
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_107_BITN                         11
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_107_M                    0x00000800
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_107_S                            11

// Field:    [10] WRT_PROT_SEC_106
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_106                      0x00000400
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_106_BITN                         10
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_106_M                    0x00000400
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_106_S                            10

// Field:     [9] WRT_PROT_SEC_105
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_105                      0x00000200
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_105_BITN                          9
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_105_M                    0x00000200
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_105_S                             9

// Field:     [8] WRT_PROT_SEC_104
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_104                      0x00000100
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_104_BITN                          8
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_104_M                    0x00000100
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_104_S                             8

// Field:     [7] WRT_PROT_SEC_103
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_103                      0x00000080
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_103_BITN                          7
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_103_M                    0x00000080
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_103_S                             7

// Field:     [6] WRT_PROT_SEC_102
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_102                      0x00000040
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_102_BITN                          6
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_102_M                    0x00000040
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_102_S                             6

// Field:     [5] WRT_PROT_SEC_101
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_101                      0x00000020
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_101_BITN                          5
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_101_M                    0x00000020
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_101_S                             5

// Field:     [4] WRT_PROT_SEC_100
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_100                      0x00000010
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_100_BITN                          4
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_100_M                    0x00000010
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_100_S                             4

// Field:     [3] WRT_PROT_SEC_99
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_99                       0x00000008
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_99_BITN                           3
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_99_M                     0x00000008
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_99_S                              3

// Field:     [2] WRT_PROT_SEC_98
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_98                       0x00000004
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_98_BITN                           2
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_98_M                     0x00000004
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_98_S                              2

// Field:     [1] WRT_PROT_SEC_97
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_97                       0x00000002
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_97_BITN                           1
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_97_M                     0x00000002
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_97_S                              1

// Field:     [0] WRT_PROT_SEC_96
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_96                       0x00000001
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_96_BITN                           0
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_96_M                     0x00000001
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_96_S                              0


#endif // __CCFG__
